share/tutorials/incompressible/simple/turbine_siting/0.org/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      U;
}

#include        "include/initialConditions"
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform $flowVelocity;

boundaryField
{
  outlet
  {
    type            inletOutlet;
    inletValue      uniform (0 0 0);
    value           $internalField;
  }
  inlet
  {
    type            atmBoundaryLayerInletVelocity;
    #include        "include/ABLConditions"
  }
  terrain
  {
    type            uniformFixedValue;
    uniformValue    (0 0 0);
    value           uniform (0 0 0);
  }
  ground
  {
    type            uniformFixedValue;
    value           uniform (0 0 0);
    uniformValue    constant (0 0 0);
  }
  #include "include/sideAndTopPatches"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
