share/tutorials/incompressible/simple/turbine_siting/0.org/include/initialConditions

flowVelocity         (0 0 0);
pressure             0;
turbulentKE          1.3;
turbulentEpsilon     0.01;

// vim: set ft=foam et sw=2 ts=2 sts=2:
