share/tutorials/incompressible/simple/turbine_siting/0.org/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  #include "include/ABLConditions"
  inlet
  {
    type            calculated;
    value           uniform 0;
  }
  outlet
  {
    type            calculated;
    value           uniform 0;
  }
  terrain
  {
    type            nutkAtmRoughWallFunction;
    z0              $z0;
    value           uniform 0.0;
  }
  ground
  {
    type            calculated;
    value           uniform 0;
  }
  #include "include/sideAndTopPatches"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
