share/tutorials/incompressible/simple/turbine_siting/constant/fvOptions
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      fvOptions;
}

disk1
{
  type            actuationDiskSource;
  active          on;
  actuationDiskSourceCoeffs
  {
    fieldNames      (U);
    selectionMode   cellSet;
    cellSet         actuationDisk1;
    diskDir         (1 0 0);    // Orientation of the disk
    Cp              0.386;
    Ct              0.58;
    diskArea        40;
    upstreamPoint   (581849 4785810 1065);
  }
}
disk2
{
  type            actuationDiskSource;
  active          on;
  actuationDiskSourceCoeffs
  {
    fieldNames      (U);
    selectionMode   cellSet;
    cellSet         actuationDisk2;
    diskDir         (1 0 0);    // Orientation of the disk
    Cp              0.53;
    Ct              0.58;
    diskArea        40;
    upstreamPoint   (581753 4785663 1070);
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
