share/tutorials/incompressible/simple/turbine_siting/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      turbulenceProperties;
}

simulationType RAS;
RAS
{
  RASModel            kEpsilon;
  turbulence          on;
  printCoeffs         on;
  kEpsilonCoeffs
  {
    Cmu         0.09;
    C1          1.44;
    C2          1.92;
    sigmaEps    1.11; //Original value:1.44
    // See:
    // D.M. Hargreaves and N.G. Wright
    // "On the use of the k-Epsilon model in commercial CFD software
    // to model the neutral atmospheric boundary layer",
    // J. of wind engineering and industrial aerodymanics,
    // 95(2007) 355-269
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
