share/tutorials/incompressible/simple/turbine_siting/system/decomposeParDict.ptscotch
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      decomposeParDict;
}

numberOfSubdomains 4;
method          ptscotch;

// vim: set ft=foam et sw=2 ts=2 sts=2:
